# 2*n 크기 직사각형 1x2, 2x1 타일로 채우는 방법의 수


import sys
input = sys.stdin.readline

n = int(input())

dp = [0]*(n+1)
dp[0]=0

# n이 1이면 1짜리타일 하나, 
"""
[0][0][0][0][0][0]
[0][0][0][0][0][0]

이차원 배열로 들어가야하나?
2x1 이면 dp[1][1]
1x2 이면 dp[2][1]

n=1, dp[1] = 1
[1]
[1] 

n=2, dp[2] = 2
[0][0] [2][]  [1][1]
[0][0] [2][]  [1][1]

n=3, dp[3] = 3
[0][0][0]  [1][2][]  ([2][][1]  [1][1][1])
[0][0][0]  [1][2][]  ([2][][1]  [1][1][1])

n=4, 
"""


if n == 1:
	print(1)
elif n == 2:
	print(2)
elif n >= 3:
	dp[1] = 1
	dp[2] = 2
	for i in range(3,n+1):
		dp[i] = dp[i-1] + dp[i-2]
	print(dp[n]%10007)


